Readme.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: adaptative-theme
#+date: \today
#+author: Álvaro Cortés Sánchez-Migallón
#+email: alvarocsm.91@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.0.50 (Org mode 9.3.6)
#+latex_class: article
#+latex_class_options:
#+latex_header:
#+latex_header_extra:
#+description:
#+keywords: Emacs, Lisp, Scraping, Theme, Adaptative
#+subtitle: adaptative theme documentation
#+latex_compiler: pdflatex

\newpage

* adaptative-theme

  This file contains package function explanation, all use cases and description
  with examples. For more information, please contact me.

* Installation

  Easy to install, clone this project into your/.emacs.d/ folder and include
  next code at the end of your /init.el/ file.

  #+begin_src lisp
    (load-file "./adaptative-theme/adaptative-theme.el")
  #+end_src

* Requirements

  To use *adaptative-theme-location* scraping require /[[https://github.com/alphapapa/org-web-tools][org-web-tools]]/ package,
  installed when use the function thet require it. This package require /Emacs
  25.1/ or later varsion. This functions has been tested with my /init.el/
  configuration and /Emacs 28.0.50/.

  - Emacs 28.0.50
  - org-web-tools package (intalled when use)

* How to use

  You can use different functions included in /adaptative-theme.el/ file, in this
  section is explained how to use.

** adaptative-theme

   This is most simply function, only compare current hour with default or
   customized hour and load selected theme. This is faster function.

   Default time

   #+begin_src lisp
     (adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard)
   #+end_src

   Customized time, am time 08:01:03, pm time 20:02:04.

   #+begin_src lisp
     (adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard 08 20 01 02 03 04)
   #+end_src

** adaptative-theme-location

   This function allow to get am and pm time from the city that you want,
   thought to set your current city and country. Is slower than
   /adaptative-theme/ because require to access to internet to get data time.

   Please, search your city in https://www.timeanddate.com/sun to execute this
   function successfuly. As before function, have two methods, becouse have
   optional arguments.

   Default location. Madrid, Spain.

   #+begin_src lisp
     (adaptative-theme-location 'gruvbox-light-soft 'gruvbox-dark-hard)
   #+end_src

   Customized location, in munich city and germany as country.

   #+begin_src lisp
     (adaptative-theme-location 'gruvbox-light-soft
     'gruvbox-dark-hard "germany" "munich")
   #+end_src

** adaptative-theme-autolocation

   This function allow to get am and pm time from the city that you are. Is
   slower than /adaptative-theme/ /adaptative-theme-location/ because require to
   access to internet to get data time and location.

   #+begin_src lisp
     (adaptative-theme-autolocation 'gruvbox-light-soft 'gruvbox-dark-hard)
   #+end_src

* Change log. Ver/Rev.

** A/0

   First version include operative /adaptative-theme/ without errors and
   /adaptative-theme-location/ in debug stage.

** A/1

   Stable version /adaptative-theme/, /adaptative-theme-location/ and
   /adaptative-theme-autolocation/.

* Development

  All contributions and suggersion are welcome, only thinking to improve.

