adaptative-theme.el
;;; Adaptative theme function
(defun adaptative-theme
  (light-theme dark-theme &optional am-hour pm-hour am-min pm-min am-sec pm-sec)
  " Adaptative theme function:
@Brief:   This function allow to configure different themes depending on the
          emacs initialization time.

@Author:  acsm

@Version: A/1

@Args:    light-theme: Theme loaded in sun hours.
          dark-theme:  Theme loaded in dark hours.
          &-am-hour: Custom dawn hour (0-23) (optional, default 07)
          &-pm-hour: Custom sunset hour (0-23) (optional, default 20)
          &-am-min:  Custom dawn min (0-59) (optional, default 00)
          &-pm-min:  Custom sunset min (0-59) (optional, default 00)
          &-am-sec:  Custom dawn sec (0-59) (optional, default 00)
          &-pm-sec:  Custom sunset sec (0-59) (optional, default 00)

@Links:
"

;;;; Set default values
  ;; Set dawn time
  (unless (eval am-hour)
    (set 'am-hour 7))
  (unless (eval am-min)
    (set 'am-min 00))
  (unless (eval am-sec)
    (set 'am-sec 00))

  ;; Set sundown time
  (unless (eval pm-hour)
    (set 'pm-hour 20))
  (unless (eval pm-min)
    (set 'pm-min 00))
  (unless (eval pm-sec)
    (set 'pm-sec 00))

  ;; Set dawn time aux
  (setq am-hour-init am-hour)
  (setq am-min-init am-min)
  (setq am-sec-init am-sec)
  ;; Set sundown time
  (setq pm-hour-init pm-hour)
  (setq pm-min-init pm-min)
  (setq pm-sec-init pm-sec)

;;;; Get time
  (set 'init-time (current-time-string))

;;;; Get integer hour
  ;; Get hour
  (set 'init-hour-str (substring init-time 11 13))
  (set 'init-hour-int (string-to-number init-hour-str 10))
  ;; Get minute
  (set 'init-min-str (substring init-time 14 16))
  (set 'init-min-int (string-to-number init-min-str 10))
  ;; Get Second
  (set 'init-sec-str (substring init-time 17 19))
  (set 'init-sec-int (string-to-number init-sec-str 10))

;;;; Detect if is day
  (setq is-day t)
  (setq is-morning nil)
  (setq is-night nil)

;;;;; Compare with am
;;;;;; Hour
  (if (< init-hour-int am-hour)
      ;; true if init hour <  dawn hour is night
      (set 'is-day nil)
    ;; Evaluate minutes if is the same hour
    (if (= init-hour-int am-hour)
        ;; evaluate minutes
        (if (< init-min-int am-min)
            ;; true if init min <  dawn min is night
            (set 'is-day nil)
          ;; Evaluate seconds if is the same minute
          (if (= init-sec-int am-sec)
              ;; evaluate seconds
              (if (< init-sec-int am-sec)
                  ;; true if init sec <  dawn sec is night
                  (set 'is-day nil)
                  )))
          )
      )

  ;; Is is before day is morning
  (if (null is-day)
      (setq is-morning t))

;;;;; Compare with pm
;;;;;; Hour
  (if (> init-hour-int pm-hour)
      ;; true if init hour >  sunset hour is night
      (set 'is-day nil)
    ;; Evaluate minutes if is the same hour
    (if (= init-hour-int pm-hour)
        ;; evaluate minutes
        (if (> init-min-int pm-min)
            ;; true if init min >  sunset min is night
            (set 'is-day nil)
          ;; Evaluate seconds if is the same minute
          (if (= init-sec-int pm-sec)
              ;; evaluate seconds
              (if (> init-sec-int pm-sec)
                  ;; true if init sec >  sunset sec is night
                  (set 'is-day nil)))
          )
      )
    )

  ;; If is not day and no morning is night
  (if (null is-day)
      (if (null is-morning)
          (setq is-night t)))

;;;; Load theme
  (if is-day
      ;; Load ligth theme if is day
      (load-theme light-theme t)
    ;;(load-theme 'gruvbox-light-soft t)
    ;; Load dark theme if is not day
    (load-theme dark-theme t))
  ;;(load-theme 'gruvbox-dark-hard t))

;;;; Program nex theme change
  ;; Timer example
  ;;(run-at-time "5 sec" nil #'message "Prueba timer")
  ;;(run-at-time "20:30" nil #'kill-emacs)
  ;;(run-at-time "5 sec" nil #'adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard)

  ;;;;; Calculate time before change day - night
  (if (eval is-day)
      (if (> pm-min 58)
          (lambda ()
            (if (equal pm-hour 23)
              (setq pm-hour 0)
              (setq pm-hour (+ pm-hour 1))
              )
            (setq pm-hour (+ pm-hour 1))
            (setq pm-min 0))
        (setq pm-min (+ pm-min 1))
        )
    ;; If is not day
    (if (equal am-min 59)
        (lambda ()
          (if (equal am-hour 23)
            (setq am-hour 0)
            (setq am-hour (+ am-hour 1))
            )
          (setq am-min 0))
      (setq am-min (+ am-min 1))
      )
    )

  ;; Calculate next hour as str
  (if (< pm-hour 10)
      (setq pm-hour-str (concat "0" (number-to-string pm-hour)))
    (setq pm-hour-str (number-to-string pm-hour))
    )

  ;; Calculate next min asl str
  (if (< pm-min 10)
      (setq pm-min-str (concat "0" (number-to-string pm-min)))
    (setq pm-min-str (number-to-string pm-min))
    )

  ;; Define pm hour
  (setq pm-str (concat pm-hour-str ":" pm-min-str))

  ;; Calculate next hour as str
  (if (< am-hour 10)
      (setq am-hour-str (concat "0" (number-to-string am-hour)))
    (setq am-hour-str (number-to-string am-hour))
    )

  ;; Calculate next min asl str
  (if (< am-min 10)
      (setq am-min-str (concat "0" (number-to-string am-min)))
    (setq am-min-str (number-to-string am-min))
    )

  ;; Define am hour
  (setq am-str (concat am-hour-str ":" am-min-str))

  ;; If is night use timer in seconds
  (if (eval is-night)
      (lambda ()
        (setq am-str-int (+ (* (- 23 init-hour-int) 3600)
                            (* (- 59 init-min-int) 60)
                            (- 59 init-sec-int)))
        (setq am-str (concat (number-to-string am-str-int) " sec")))
    )

;;;;; Program
;; Cancel timer if exist
(if (eval is-day)
    (if (boundp 'am-timer)
        (cancel-timer am-timer)
      )
  (if (boundp 'pm-timer)
      (cancel-timer pm-timer)
    )
  )

;; Reset timer
(if (eval is-day)
    (setq pm-timer (run-at-time pm-str nil #'adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard (eval am-hour-init) (eval pm-hour-init) (eval am-min-init) (eval pm-min-init) (eval am-sec-init) (eval pm-sec-init))))

(if (eval is-morning)
    (setq am-timer (run-at-time am-str nil #'adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard (eval am-hour-init) (eval pm-hour-init) (eval am-min-init) (eval pm-min-init) (eval am-sec-init) (eval pm-sec-init))))

;;(if (eval is-night)
;;    (setq am-timer (run-at-time am-str nil #'adaptative-theme 'gruvbox-light-soft 'gruvbox-dark-hard (eval am-hour-init) (eval pm-hour-init) (eval am-min-init) (eval pm-min-init) (eval am-sec-init) (eval pm-sec-init))))

    )

;;; Adaptative theme location
